MikroElektronika/core_packages/PIC/XC8/def/PIC18F67J11/mcu.h
// Register: PMCON
#define PMCON PMCON
extern volatile unsigned short          PMCON               __at(0xF64);
#ifndef _LIB_BUILD
asm("PMCON equ 0F64h");
#endif

// Register: PMCONL
#define PMCONL PMCONL
extern volatile unsigned char           PMCONL              __at(0xF64);
#ifndef _LIB_BUILD
asm("PMCONL equ 0F64h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RDSP                   :1;
        unsigned WRSP                   :1;
        unsigned BEP                    :1;
        unsigned CS1P                   :1;
        unsigned CS2P                   :1;
        unsigned ALP                    :1;
        unsigned CSF0                   :1;
        unsigned CSF1                   :1;
    };
} PMCONLbits_t;
extern volatile PMCONLbits_t PMCONLbits __at(0xF64);
// bitfield macros
#define _PMCONL_RDSP_POSN                                   0x0
#define _PMCONL_RDSP_POSITION                               0x0
#define _PMCONL_RDSP_SIZE                                   0x1
#define _PMCONL_RDSP_LENGTH                                 0x1
#define _PMCONL_RDSP_MASK                                   0x1
#define _PMCONL_WRSP_POSN                                   0x1
#define _PMCONL_WRSP_POSITION                               0x1
#define _PMCONL_WRSP_SIZE                                   0x1
#define _PMCONL_WRSP_LENGTH                                 0x1
#define _PMCONL_WRSP_MASK                                   0x2
#define _PMCONL_BEP_POSN                                    0x2
#define _PMCONL_BEP_POSITION                                0x2
#define _PMCONL_BEP_SIZE                                    0x1
#define _PMCONL_BEP_LENGTH                                  0x1
#define _PMCONL_BEP_MASK                                    0x4
#define _PMCONL_CS1P_POSN                                   0x3
#define _PMCONL_CS1P_POSITION                               0x3
#define _PMCONL_CS1P_SIZE                                   0x1
#define _PMCONL_CS1P_LENGTH                                 0x1
#define _PMCONL_CS1P_MASK                                   0x8
#define _PMCONL_CS2P_POSN                                   0x4
#define _PMCONL_CS2P_POSITION                               0x4
#define _PMCONL_CS2P_SIZE                                   0x1
#define _PMCONL_CS2P_LENGTH                                 0x1
#define _PMCONL_CS2P_MASK                                   0x10
#define _PMCONL_ALP_POSN                                    0x5
#define _PMCONL_ALP_POSITION                                0x5
#define _PMCONL_ALP_SIZE                                    0x1
#define _PMCONL_ALP_LENGTH                                  0x1
#define _PMCONL_ALP_MASK                                    0x20
#define _PMCONL_CSF0_POSN                                   0x6
#define _PMCONL_CSF0_POSITION                               0x6
#define _PMCONL_CSF0_SIZE                                   0x1
#define _PMCONL_CSF0_LENGTH                                 0x1
#define _PMCONL_CSF0_MASK                                   0x40
#define _PMCONL_CSF1_POSN                                   0x7
#define _PMCONL_CSF1_POSITION                               0x7
#define _PMCONL_CSF1_SIZE                                   0x1
#define _PMCONL_CSF1_LENGTH                                 0x1
#define _PMCONL_CSF1_MASK                                   0x80

// Register: PMCONH
#define PMCONH PMCONH
extern volatile unsigned char           PMCONH              __at(0xF65);
#ifndef _LIB_BUILD
asm("PMCONH equ 0F65h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PTRDEN                 :1;
        unsigned PTWREN                 :1;
        unsigned PTBEEN                 :1;
        unsigned ADRMUX0                :1;
        unsigned ADRMUX1                :1;
        unsigned PSIDL                  :1;
        unsigned                        :1;
        unsigned PMPEN                  :1;
    };
} PMCONHbits_t;
extern volatile PMCONHbits_t PMCONHbits __at(0xF65);
// bitfield macros
#define _PMCONH_PTRDEN_POSN                                 0x0
#define _PMCONH_PTRDEN_POSITION                             0x0
#define _PMCONH_PTRDEN_SIZE                                 0x1
#define _PMCONH_PTRDEN_LENGTH                               0x1
#define _PMCONH_PTRDEN_MASK                                 0x1
#define _PMCONH_PTWREN_POSN                                 0x1
#define _PMCONH_PTWREN_POSITION                             0x1
#define _PMCONH_PTWREN_SIZE                                 0x1
#define _PMCONH_PTWREN_LENGTH                               0x1
#define _PMCONH_PTWREN_MASK                                 0x2
#define _PMCONH_PTBEEN_POSN                                 0x2
#define _PMCONH_PTBEEN_POSITION                             0x2
#define _PMCONH_PTBEEN_SIZE                                 0x1
#define _PMCONH_PTBEEN_LENGTH                               0x1
#define _PMCONH_PTBEEN_MASK                                 0x4
#define _PMCONH_ADRMUX0_POSN                                0x3
#define _PMCONH_ADRMUX0_POSITION                            0x3
#define _PMCONH_ADRMUX0_SIZE                                0x1
#define _PMCONH_ADRMUX0_LENGTH                              0x1
#define _PMCONH_ADRMUX0_MASK                                0x8
#define _PMCONH_ADRMUX1_POSN                                0x4
#define _PMCONH_ADRMUX1_POSITION                            0x4
#define _PMCONH_ADRMUX1_SIZE                                0x1
#define _PMCONH_ADRMUX1_LENGTH                              0x1
#define _PMCONH_ADRMUX1_MASK                                0x10
#define _PMCONH_PSIDL_POSN                                  0x5
#define _PMCONH_PSIDL_POSITION                              0x5
#define _PMCONH_PSIDL_SIZE                                  0x1
#define _PMCONH_PSIDL_LENGTH                                0x1
#define _PMCONH_PSIDL_MASK                                  0x20
#define _PMCONH_PMPEN_POSN                                  0x7
#define _PMCONH_PMPEN_POSITION                              0x7
#define _PMCONH_PMPEN_SIZE                                  0x1
#define _PMCONH_PMPEN_LENGTH                                0x1
#define _PMCONH_PMPEN_MASK                                  0x80

// Register: PMDIN1
#define PMDIN1 PMDIN1
extern volatile unsigned short          PMDIN1              __at(0xF66);
#ifndef _LIB_BUILD
asm("PMDIN1 equ 0F66h");
#endif

// Register: PMDIN1L
#define PMDIN1L PMDIN1L
extern volatile unsigned char           PMDIN1L             __at(0xF66);
#ifndef _LIB_BUILD
asm("PMDIN1L equ 0F66h");
#endif

// Register: PMDIN1H
#define PMDIN1H PMDIN1H
extern volatile unsigned char           PMDIN1H             __at(0xF67);
#ifndef _LIB_BUILD
asm("PMDIN1H equ 0F67h");
#endif

// Register: PMADDR
#define PMADDR PMADDR
extern volatile unsigned short          PMADDR              __at(0xF68);
#ifndef _LIB_BUILD
asm("PMADDR equ 0F68h");
#endif
// aliases
extern volatile unsigned short          PMDOUT1             __at(0xF68);
#ifndef _LIB_BUILD
asm("PMDOUT1 equ 0F68h");
#endif

// Register: PMADDRL
#define PMADDRL PMADDRL
extern volatile unsigned char           PMADDRL             __at(0xF68);
#ifndef _LIB_BUILD
asm("PMADDRL equ 0F68h");
#endif

